{
  "articles": [
    {
      "id": "ai-in-2025-opinion",
      "title": "AI in 2025",
      "category": "Essay",
      "date": "2025-11-19",
      "excerpt": "A personal critique of the omnipresence of AI in modern workflows, questioning whether adoption is truly a net benefit for ordinary users, workers, and the broader tech ecosystem.",
      "content": "What do you think when you think of the technological advancements that happened this year?\n\nNow think. How many of them have been AI-related in some way?\n\nExactly.\n\nWe all use a little AI in all our workflows, believe it or not. I know many a person who seem to be against GenAI on the outside, but secretly use ChatGPT to make their searching a little easier.\n\nThis utility that AI has for us is not a tool, but it is a leech. Companies like Microsoft and OpenAI believe that, because of these niche applications of AI, they could earn more money by shoving it into every nook and cranny of their goddamn ecosystem.\nAsk any Windows 11 user and you'll probably get to know the average user's experience with something like Copilot.\n\nAI has boosted the Global GDP, yes- there's no doubt in that. AI adoption is projected to deliver a 12–15% boost to global GDP over the next decade, equal to between $7 and $15.7 trillion in additional output. Rapid automation of routine tasks and optimization of logistics, manufacturing, and services have driven efficiency and supported broad sector growth. But at what cost? Labor markets have become more volatile, as the jobs around AI are much fewer in number than traditional white collar jobs. Additionally, the old sanctity of the workplace is diminished by the cold automation done by these companies. This may seem silly to hear, but I fear having to work around AI automated servers is like having a really stupid junior engineer who's sole merit is doing things quickly, but who needs hyperspecific instructions for even basic tasks. Rubbish, honestly!\n\nHowever may the big firms say \"upskilling\" is necessary, using AI still depends largely on the tool itself. And as we are nearing the popping of the AI bubble, the skills we worked so hard to acquire might become as useless as IT degrees are now, in countries like India. It would be a relic of a bygone time.\n\nAdditionally, AI usage for the consumer is hardly optimized either. It is shoved into every app, every website, every OS- (not you, Linux!) only because it is another buzzword to add to the pile of slop these companies already produce. Useless AI applications, where humans more than excel already, and where AI is basically useless for the consumer, are growing day by day, making our life harder as well as the worker's.\n\nOutside of software, the AI bubble is making the hardware market experience a sharp decline in availability of parts. RAM has more than tripled in price, mostly because AI firms are buying massive amounts of RAM to run their LLMs, and it is a very bad time to buy most hardware- GPU companies like NVidia are earning way more from AI firms, so they are not incentivised to work for the consumer. SSDs and HDDs for storage, also have had an increase in price, which means an annoying uptick to anyone wanting to make a build in 2025.\n\nHow do we use AI safely? Well, like all good things in life, there are FOSS alternatives. FOSS is a concept that means FREE, OPEN SOURCE, SOFTWARE. People with good gpus can run local AIs, and experiment with them too, while keeping privacy secure (Ooh, that is a good topic for the future!) in this age of publicity.\n\nIn my personal opinion, the working class of white collar workers need to unionise. Many of them possess skills in management, programming, and other fields, which are a boon in software development, but are chained by the bounds of corporate life. Their passion and love for code, for computers, evaporates in contact with corporate life; Some enjoy the job, some don't. However, a union of white collar workers could fuel this young flame within each other again; they will protect each other from the bounds of corporate life, and encourage a new wave of innovation, for programmers by programmers.\n\nMany projects like this exist already- Linux Kernel, KDE, etc. all work unionised, not as a company, and whoever feels passionate and can contribute is free to do so. That is the beauty of FOSS, and why closed source corporate software will never match the beauty of FOSS.\n\nI feel non-profit oriented programming should work best for us in this era, closing the age of subscription based services and bringing a new flame of free, open source alternatives, to which anyone can contribute and do their part, for the good of both the user, the developer, and the software.\n\nThanks for reading my first article! I'll expand on the topics of privacy and white-collar unions more in a later essay, as I feel this one is getting a bit too wordy. I'll see you in the next one!\n\n- iris"
    }
  ]
}
